In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('employees.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [4]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Salary,1000.0,90662.181000,32923.693342,35013.000,62613.00000,90428.0000,118740.250,149908.000
Bonus %,1000.0,10.207555,5.528481,1.015,5.40175,9.8385,14.838,19.944

In [5]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [6]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [7]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance

In [8]:
df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])

In [9]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-27 11:17:00,130590,11.858,False,Finance

In [10]:
df['Senior Management'].astype('bool')

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior Management, Length: 1000, dtype: bool

In [11]:
df['Senior Management'] = df['Senior Management'].astype('bool')

In [12]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-27 11:17:00,130590,11.858,False,Finance

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.8+ KB

In [14]:
df['Gender'] = df['Gender'].astype('category')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

In [16]:
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])
# df['Start Date'] = pd.to_datetime(df['Start Date'])
# df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

In [17]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-27 11:17:00,130590,11.858,False,Finance

# Filter a Data Frame Based On A Condition

In [18]:
df['Gender']

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: category
Categories (2, object): ['Female', 'Male']

In [19]:
df[df.Gender == 'Male']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2020-12-27 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-12-27 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2020-12-27 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2020-12-27 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2020-12-27 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-12-27 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-12-27 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-12-27 18:24:00,129949,10.169,True,Sales

In [20]:
mask = df['Start Date'] < '1985-01-01'

In [21]:
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2020-12-27 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2020-12-27 01:08:00,112807,17.492,True,Human Resources
18,Diana,Female,1981-10-23,2020-12-27 10:27:00,132940,19.082,False,Client Services
28,Terry,Male,1981-11-27,2020-12-27 18:30:00,124008,13.464,True,Client Services
37,Linda,Female,1981-10-19,2020-12-27 20:49:00,57427,9.557,True,Client Services
...,...,...,...,...,...,...,...,...
982,Rose,Female,1982-04-06,2020-12-27 10:43:00,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,2020-12-27 22:35:00,146907,11.738,False,Engineering
985,Stephen,NaN,1983-07-10,2020-12-27 20:10:00,85668,1.909,False,Legal
986,Donna,Female,1982-11-26,2020-12-27 07:04:00,82871,17.999,False,Marketing
996,Phillip,Male,1984-01-31,2020-12-27 06:30:00,42392,19.675,False,Finance

In [22]:
df[df.Salary > 110_000]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2020-12-27 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-12-27 13:00:00,138705,9.340,True,Finance
5,Dennis,Male,1987-04-18,2020-12-27 01:35:00,115163,10.125,False,Legal
9,Frances,Female,2002-08-08,2020-12-27 06:51:00,139852,7.524,True,Business Development
12,Brandon,Male,1980-12-01,2020-12-27 01:08:00,112807,17.492,True,Human Resources
...,...,...,...,...,...,...,...,...
987,Gloria,Female,2014-12-08,2020-12-27 05:08:00,136709,10.331,True,Finance
991,Rose,Female,2002-08-25,2020-12-27 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2020-12-27 08:35:00,112769,11.625,True,Finance
995,Henry,NaN,2014-11-23,2020-12-27 06:09:00,132483,16.655,False,Distribution
999,Albert,Male,2012-05-15,2020-12-27 18:24:00,129949,10.169,True,Sales

In [23]:
#filtering for true values using bool
df[df['Senior Management']]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2020-12-27 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-12-27 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2020-12-27 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2020-12-27 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2020-12-27 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2020-12-27 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2020-12-27 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2020-12-27 18:24:00,129949,10.169,True,Sales

In [24]:
df[df.Team != 'Marketing']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-27 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-12-27 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-12-27 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2020-12-27 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2020-12-27 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2020-12-27 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-12-27 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-12-27 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-12-27 18:24:00,129949,10.169,True,Sales

# Multiple Conditions

In [25]:
df[(df.Gender == 'Male') & (df.Team == 'Marketing')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2020-12-27 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2020-12-27 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2020-12-27 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2020-12-27 20:13:00,107391,1.260,True,Marketing
101,Aaron,Male,2012-02-17,2020-12-27 10:20:00,61602,11.849,True,Marketing
104,John,Male,1989-12-23,2020-12-27 07:01:00,80740,19.305,False,Marketing
112,Willie,Male,2003-11-27,2020-12-27 06:21:00,64363,4.023,False,Marketing
119,Paul,Male,2008-06-03,2020-12-27 15:05:00,41054,12.299,False,Marketing
150,Sean,Male,1996-05-04,2020-12-27 20:59:00,135490,19.934,False,Marketing
187,Roger,Male,2004-11-19,2020-12-27 15:55:00,51430,6.460,False,Marketing
204,Willie,Male,2006-06-06,2020-12-27 09:45:00,55281,4.935,True,Marketing
216,Matthew,Male,2013-07-31,2020-12-27 08:04:00,142373,2.462,False,Marketing
252,Ralph,Male,2004-11-11,2020-12-27 01:35:00,71896,4.232,True,Marketing
274,Howard,Male,1982-10-05,2020-12-27 07:22:00,97490,5.460,True,Marketing
293,Jesse,Male,1999-10-25,2020-12-27 15:35:00,118733,9.653,False,Marketing
309,Benjamin,Male,1984-09-11,2020-12-27 06:37:00,84810,15.794,False,Marketing
327,Aaron,Male,1994-01-29,2020-12-27 18:48:00,58755,5.097,True,Marketing
353,NaN,Male,1997-04-22,2020-12-27 21:36:00,65078,3.095,True,Marketing
403,Craig,Male,1984-02-08,2020-12-27 04:45:00,113506,19.642,False,Marketing
413,Johnny,Male,1992-09-14,2020-12-27 08:21:00,115194,5.861,True,Marketing
452,Scott,Male,2012-11-17,2020-12-27 14:47:00,146812,1.965,True,Marketing
454,NaN,Male,1995-02-21,2020-12-27 00:26:00,136602,10.429,True,Marketing
461,Jeremy,Male,2001-08-09,2020-12-27 03:56:00,43354,13.946,False,Marketing
464,Lawrence,Male,2005-05-13,2020-12-27 01:25:00,74640,18.641,False,Marketing
484,Joe,Male,2000-04-14,2020-12-27 15:14:00,50645,11.119,False,Marketing
496,Johnny,Male,2016-02-26,2020-12-27 19:39:00,76394,5.437,True,Marketing
503,Roger,Male,2015-08-03,2020-12-27 16:56:00,125033,4.887,True,Marketing
544,Roger,Male,2010-07-03,2020-12-27 17:11:00,105689,13.320,True,Marketing
550,Gregory,Male,1984-06-18,2020-12-27 03:46:00,82726,16.304,True,Marketing
556,Arthur,Male,2014-12-16,2020-12-27 16:56:00,66819,6.639,True,Marketing
571,Jonathan,Male,1995-04-06,2020-12-27 22:38:00,56993,18.623,False,Marketing
581,Ernest,Male,1990-01-28,2020-12-27 00:08:00,81919,15.118,False,Marketing
696,Samuel,Male,2012-05-25,2020-12-27 16:40:00,85550,11.593,True,Marketing
722,Joshua,Male,1997-06-27,2020-12-27 15:23:00,95003,5.197,True,Marketing
798,Lawrence,Male,1984-10-01,2020-12-27 14:06:00,102589,17.952,True,Marketing
860,Phillip,Male,1984-10-07,2020-12-27 11:05:00,36837,14.660,False,Marketing
867,Earl,Male,2013-06-15,2020-12-27 03:00:00,48046,7.737,False,Marketing
899,Walter,Male,1992-05-21,2020-12-27 00:39:00,144701,16.323,True,Marketing
947,NaN,Male,2012-07-30,2020-12-27 15:07:00,107351,5.329,True,Marketing
994,George,Male,2013-06-21,2020-12-27 17:47:00,98874,4.479,True,Marketing

In [26]:
#Or operator
df[(df.Gender == 'Male') | (df.Team == 'Marketing')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2020-12-27 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-12-27 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2020-12-27 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2020-12-27 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2020-12-27 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-12-27 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-12-27 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-12-27 18:24:00,129949,10.169,True,Sales

In [27]:
mask1 = df['First Name'] == 'Robert'
mask2 = df['Team'] == 'Client Services'
mask3 = df['Start Date'] > '2016-06-01'

df[(mask1 & mask2) | mask3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2020-12-27 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2020-12-27 19:47:00,100705,16.961,True,Marketing
387,Robert,Male,1994-10-29,2020-12-27 04:26:00,123294,19.894,False,Client Services
451,Terry,NaN,2016-07-15,2020-12-27 00:29:00,140002,19.490,True,Marketing

# The .isin() Method

In [28]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-27 11:17:00,130590,11.858,False,Finance

In [29]:
#All the rows where the value in Team column is legal, sales, or product
mask1 = df['Team'] == 'Legal'
mask2 = df['Team'] == 'Sales'
mask3 = df['Team'] == 'Product'

In [30]:
df[mask1 | mask2 | mask3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2020-12-27 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2020-12-27 16:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,2020-12-27 15:19:00,102508,12.637,True,Legal
13,Gary,Male,2008-01-27,2020-12-27 23:40:00,109831,5.831,False,Sales
15,Lillian,Female,2016-06-05,2020-12-27 06:09:00,59414,1.256,False,Product
...,...,...,...,...,...,...,...,...
981,James,Male,1993-01-15,2020-12-27 17:19:00,148985,19.280,False,Legal
985,Stephen,NaN,1983-07-10,2020-12-27 20:10:00,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,2020-12-27 16:58:00,38344,3.794,False,Legal
997,Russell,Male,2013-05-20,2020-12-27 12:39:00,96914,1.421,False,Product
999,Albert,Male,2012-05-15,2020-12-27 18:24:00,129949,10.169,True,Sales

In [31]:
mask = df['Team'].isin(['Legal', 'Sales', 'Product'])

In [32]:
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2020-12-27 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2020-12-27 16:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,2020-12-27 15:19:00,102508,12.637,True,Legal
13,Gary,Male,2008-01-27,2020-12-27 23:40:00,109831,5.831,False,Sales
15,Lillian,Female,2016-06-05,2020-12-27 06:09:00,59414,1.256,False,Product
...,...,...,...,...,...,...,...,...
981,James,Male,1993-01-15,2020-12-27 17:19:00,148985,19.280,False,Legal
985,Stephen,NaN,1983-07-10,2020-12-27 20:10:00,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,2020-12-27 16:58:00,38344,3.794,False,Legal
997,Russell,Male,2013-05-20,2020-12-27 12:39:00,96914,1.421,False,Product
999,Albert,Male,2012-05-15,2020-12-27 18:24:00,129949,10.169,True,Sales

# .isnull() and .notnull() Methods

In [33]:
mask = df['Team'].isnull()

In [34]:
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,2020-12-27 09:01:00,63241,15.132,True,NaN
23,NaN,Male,2012-06-14,2020-12-27 16:19:00,125792,5.042,True,NaN
32,NaN,Male,1998-08-21,2020-12-27 14:27:00,122340,6.417,True,NaN
91,James,NaN,2005-01-26,2020-12-27 23:00:00,128771,8.309,False,NaN
109,Christopher,Male,2000-04-22,2020-12-27 10:15:00,37919,11.449,False,NaN
139,NaN,Female,1990-10-03,2020-12-27 01:08:00,132373,10.527,True,NaN
199,Jonathan,Male,2009-07-17,2020-12-27 08:15:00,130581,16.736,True,NaN
258,Michael,Male,2002-01-24,2020-12-27 03:04:00,43586,12.659,False,NaN
290,Jeremy,Male,1988-06-14,2020-12-27 18:20:00,129460,13.657,True,NaN
314,Bobby,Male,1996-03-31,2020-12-27 17:40:00,112117,6.338,False,NaN
367,Edward,Male,1989-08-04,2020-12-27 06:06:00,66067,10.957,True,NaN
382,NaN,Female,1996-04-18,2020-12-27 15:57:00,107024,12.182,True,NaN
434,Joyce,Female,1995-02-07,2020-12-27 07:38:00,50701,14.227,True,NaN
438,Jason,Male,1998-11-20,2020-12-27 14:54:00,69244,6.220,True,NaN
445,Chris,Male,2006-12-12,2020-12-27 01:57:00,71642,1.496,False,NaN
479,Richard,Male,1997-07-04,2020-12-27 11:47:00,47647,18.787,True,NaN
512,Wanda,Female,1993-04-06,2020-12-27 03:11:00,78883,19.695,False,NaN
513,Jimmy,Male,2013-11-19,2020-12-27 19:29:00,63549,19.624,False,NaN
520,Peter,Male,2003-02-22,2020-12-27 09:09:00,56580,8.411,True,NaN
567,NaN,Female,1980-04-01,2020-12-27 20:04:00,48141,12.605,True,NaN
573,Kimberly,Female,1981-12-30,2020-12-27 04:51:00,81800,5.435,True,NaN
580,Harry,Male,1985-01-27,2020-12-27 20:18:00,65482,18.089,False,NaN
626,NaN,Female,1997-04-13,2020-12-27 08:03:00,131755,2.930,True,NaN
634,Carl,Male,1987-03-30,2020-12-27 17:59:00,75598,19.289,False,NaN
635,Randy,Male,2000-09-27,2020-12-27 03:04:00,89831,13.047,True,NaN
647,Donald,Male,1988-04-06,2020-12-27 10:00:00,122920,5.320,False,NaN
669,Joseph,NaN,1982-03-28,2020-12-27 13:05:00,86564,11.879,True,NaN
684,Alice,Female,2016-01-21,2020-12-27 17:07:00,117787,10.485,False,NaN
706,Todd,Male,1993-07-04,2020-12-27 18:53:00,128175,18.473,True,NaN
726,Daniel,Male,2016-02-29,2020-12-27 04:04:00,77287,13.000,True,NaN
753,Antonio,Male,1999-06-06,2020-12-27 22:54:00,41928,5.478,True,NaN
774,NaN,Female,2000-06-18,2020-12-27 07:36:00,106428,10.867,True,NaN
781,Lawrence,Male,1995-07-03,2020-12-27 22:55:00,46378,9.127,False,NaN
794,Nicole,Female,2004-03-01,2020-12-27 17:17:00,44021,10.286,False,NaN
826,NaN,NaN,1988-08-01,2020-12-27 01:35:00,87103,5.665,True,NaN
850,Charles,Male,1997-09-03,2020-12-27 10:04:00,148291,6.002,False,NaN
851,Bobby,Male,1996-08-19,2020-12-27 01:16:00,147842,16.158,True,NaN
853,Mildred,Female,2007-04-06,2020-12-27 22:06:00,139284,11.390,True,NaN
855,Phillip,NaN,2003-10-20,2020-12-27 11:09:00,89700,2.277,True,NaN
864,Ryan,Male,2012-11-16,2020-12-27 13:47:00,57292,6.010,False,NaN
912,Joe,Male,1998-12-08,2020-12-27 10:28:00,126120,1.020,False,NaN
951,NaN,Female,2010-09-14,2020-12-27 05:19:00,143638,9.662,True,NaN

In [35]:
mask = df.Gender.notnull()

In [36]:
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-27 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-12-27 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-12-27 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2020-12-27 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2020-12-27 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-12-27 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-12-27 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-12-27 18:24:00,129949,10.169,True,Sales

# .bewteen() Method
- range of values

In [37]:
#Two parameters, lower and upper bound
df[df.Salary.between(60000, 70000)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
6,Ruby,Female,1987-08-17,2020-12-27 16:20:00,65476,10.012,True,Product
10,Louise,Female,1980-08-12,2020-12-27 09:01:00,63241,15.132,True,NaN
20,Lois,NaN,1995-04-22,2020-12-27 19:18:00,64714,4.934,True,Legal
41,Christine,NaN,2015-06-28,2020-12-27 01:08:00,66582,11.308,True,Business Development
...,...,...,...,...,...,...,...,...
965,Catherine,Female,1989-09-25,2020-12-27 01:31:00,68164,18.393,False,Client Services
970,Alice,Female,1988-09-03,2020-12-27 20:54:00,63571,15.397,True,Product
974,Harry,Male,2011-08-30,2020-12-27 18:31:00,67656,16.455,True,Client Services
978,Sean,Male,1983-01-17,2020-12-27 14:23:00,66146,11.178,False,Human Resources
998,Larry,Male,2013-04-20,2020-12-27 16:45:00,60500,11.985,False,Business Development

In [38]:
mask = df['Start Date'].between ("1991-01-01", "1992-12-31")

In [39]:
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
24,John,Male,1992-07-01,2020-12-27 22:08:00,97950,13.873,False,Client Services
27,Scott,NaN,1991-07-11,2020-12-27 18:58:00,122367,5.218,False,Legal
75,Bonnie,Female,1991-07-02,2020-12-27 01:27:00,104897,5.118,True,Human Resources
88,Donna,Female,1991-11-27,2020-12-27 13:59:00,64088,6.155,True,Legal
116,NaN,Male,1991-06-22,2020-12-27 20:58:00,76189,18.988,True,Legal
131,Rebecca,Female,1992-07-10,2020-12-27 00:23:00,94231,17.517,False,Product
146,Patricia,Female,1992-11-25,2020-12-27 02:24:00,95322,4.150,False,Product
148,Patrick,NaN,1991-07-14,2020-12-27 02:24:00,124488,14.837,True,Sales
156,Howard,Male,1992-04-27,2020-12-27 01:10:00,105062,1.563,False,Human Resources
166,NaN,Female,1991-07-09,2020-12-27 18:52:00,42341,7.014,True,Sales
170,Irene,Female,1992-01-29,2020-12-27 11:36:00,133772,19.020,True,Sales
172,Sara,Female,1991-09-23,2020-12-27 18:17:00,97058,9.402,False,Finance
218,Gregory,NaN,1992-06-15,2020-12-27 05:08:00,98865,10.628,True,Finance
220,NaN,Female,1991-06-17,2020-12-27 12:49:00,71945,5.560,True,Marketing
245,Victor,Male,1991-04-11,2020-12-27 07:44:00,70817,17.138,False,Engineering
248,Justin,Male,1992-12-06,2020-12-27 17:58:00,82782,4.366,True,Distribution
269,NaN,Female,1992-08-02,2020-12-27 20:35:00,145316,18.517,True,Human Resources
277,Brenda,NaN,1991-05-29,2020-12-27 06:32:00,82439,19.062,False,Sales
313,Judy,Female,1991-07-01,2020-12-27 02:33:00,109510,13.457,True,Legal
328,Samuel,Male,1991-12-19,2020-12-27 02:54:00,76076,5.319,True,Finance
339,Michael,Male,1991-11-22,2020-12-27 12:57:00,98753,16.443,True,Human Resources
398,Doris,Female,1992-07-29,2020-12-27 18:40:00,85215,7.425,True,Human Resources
402,Richard,NaN,1992-11-28,2020-12-27 17:05:00,124655,14.272,True,Engineering
413,Johnny,Male,1992-09-14,2020-12-27 08:21:00,115194,5.861,True,Marketing
448,Wayne,Male,1992-01-30,2020-12-27 15:01:00,81183,17.066,False,Client Services
473,Clarence,Male,1992-08-20,2020-12-27 20:23:00,124365,8.457,False,Business Development
475,Stephanie,Female,1992-11-26,2020-12-27 00:54:00,122121,7.937,True,Engineering
483,NaN,Female,1992-04-26,2020-12-27 20:01:00,115436,3.099,True,Human Resources
516,Gloria,Female,1992-04-12,2020-12-27 20:26:00,66224,15.979,True,Legal
534,Gerald,NaN,1992-01-08,2020-12-27 15:50:00,133366,12.292,False,Legal
537,Cynthia,Female,1991-09-14,2020-12-27 13:08:00,51633,13.472,True,Business Development
546,Joseph,Male,1992-09-10,2020-12-27 18:50:00,102555,3.672,True,Product
552,Barbara,Female,1991-09-02,2020-12-27 15:41:00,127297,11.905,True,Product
603,Carl,NaN,1991-10-26,2020-12-27 08:11:00,100888,12.490,True,Business Development
613,Teresa,NaN,1992-01-03,2020-12-27 15:47:00,63103,11.378,False,Finance
618,Peter,Male,1992-11-24,2020-12-27 17:43:00,69297,1.268,False,Finance
639,Amanda,NaN,1991-08-11,2020-12-27 14:15:00,46665,19.391,True,Client Services
676,Annie,Female,1992-06-06,2020-12-27 10:04:00,138925,9.801,True,Marketing
680,Albert,Male,1992-06-17,2020-12-27 03:25:00,86818,14.301,True,Engineering
704,Thomas,Male,1991-09-07,2020-12-27 09:51:00,65251,11.211,False,Distribution
723,Brandon,NaN,1992-09-05,2020-12-27 02:32:00,144187,11.416,True,Legal
725,Jeremy,Male,1991-05-19,2020-12-27 13:40:00,131513,1.876,True,Finance
766,Justin,Male,1991-07-25,2020-12-27 00:45:00,112975,9.699,False,Human Resources
771,Peter,Male,1991-05-22,2020-12-27 01:39:00,102577,12.026,True,Product
783,NaN,NaN,1991-04-15,2020-12-27 03:39:00,132505,13.592,True,Product
802,Jane,Female,1992-01-12,2020-12-27 13:23:00,51923,13.623,False,Business Development
876,Terry,NaN,1992-09-11,2020-12-27 16:41:00,41238,8.219,False,Marketing
891,Timothy,Male,1991-08-25,2020-12-27 10:37:00,92587,8.475,False,Finance
895,Janice,NaN,1991-11-19,2020-12-27 18:02:00,139791,16.968,False,Business Development
899,Walter,Male,1992-05-21,2020-12-27 00:39:00,144701,16.323,True,Marketing
909,Donald,Male,1991-08-01,2020-12-27 02:25:00,61999,6.466,False,Product
923,Irene,NaN,1991-02-28,2020-12-27 22:23:00,135369,4.380,False,Business Development
959,Albert,Male,1992-09-19,2020-12-27 02:35:00,45094,5.850,True,Business Development
976,Denise,Female,1992-10-19,2020-12-27 05:42:00,137954,4.195,True,Legal
989,Justin,NaN,1991-02-10,2020-12-27 16:58:00,38344,3.794,False,Legal

In [40]:
df[df['Last Login Time'].between('8:30AM', '12:00PM')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2020-12-27 11:17:00,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,2020-12-27 10:43:00,45906,11.598,True,Finance
10,Louise,Female,1980-08-12,2020-12-27 09:01:00,63241,15.132,True,NaN
18,Diana,Female,1981-10-23,2020-12-27 10:27:00,132940,19.082,False,Client Services
33,Jean,Female,1993-12-18,2020-12-27 09:07:00,119082,16.180,False,Business Development
...,...,...,...,...,...,...,...,...
963,Ann,Female,1994-09-23,2020-12-27 11:15:00,89443,17.940,True,Sales
977,Sarah,Female,1995-12-04,2020-12-27 09:16:00,124566,5.949,False,Product
982,Rose,Female,1982-04-06,2020-12-27 10:43:00,91411,8.639,True,Human Resources
988,Alice,Female,2004-10-05,2020-12-27 09:34:00,47638,11.209,False,Human Resources
992,Anthony,Male,2011-10-16,2020-12-27 08:35:00,112769,11.625,True,Finance

In [41]:
import acquire

# Practice using Telco Sql database from class

In [42]:
df = acquire.get_telco_data()

In [43]:
telco = df.copy()

In [44]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               7043 non-null   object
 1   gender                    7043 non-null   object
 2   senior_citizen            7043 non-null   int64
 3   partner                   7043 non-null   object
 4   dependents                7043 non-null   object
 5   tenure                    7043 non-null   int64
 6   phone_service             7043 non-null   object
 7   multiple_lines            7043 non-null   object
 8   internet_service_type_id  7043 non-null   int64
 9   online_security           7043 non-null   object
 10  online_backup             7043 non-null   object
 11  device_protection         7043 non-null   object
 12  tech_support              7043 non-null   object
 13  streaming_tv              7043 non-null   object
 14  streaming_movies          7043 non-null   object
 15  contract_type_id          7043 non-null   int64
 16  paperless_billing         7043 non-null   object
 17  payment_type_id           7043 non-null   int64
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  contract_type             7043 non-null   object
 22  internet_service_type     7043 non-null   object
 23  payment_type              7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

In [45]:
telco.shape

(7043, 24)

In [46]:
mask = telco['gender'] == 'Male'

In [47]:
telco[mask]

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0003-MKNFE,Male,0,No,No,9,Yes,Yes,1,No,...,Yes,1,No,2,59.90,542.4,No,Month-to-month,DSL,Mailed check
3,0023-HGHWL,Male,1,No,No,1,No,No phone service,1,No,...,No,1,Yes,1,25.10,25.1,Yes,Month-to-month,DSL,Electronic check
5,0067-DKWBL,Male,1,No,No,2,Yes,No,1,Yes,...,No,1,Yes,1,49.25,91.1,Yes,Month-to-month,DSL,Electronic check
6,0076-LVEPS,Male,0,No,Yes,29,No,No phone service,1,Yes,...,No,1,Yes,2,45.00,1242.45,No,Month-to-month,DSL,Mailed check
7,0082-LDZUE,Male,0,No,No,1,Yes,No,1,No,...,No,1,Yes,2,44.30,44.3,No,Month-to-month,DSL,Mailed check
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7034,9838-BFCQT,Male,0,Yes,Yes,72,Yes,Yes,3,No internet service,...,No internet service,3,No,2,26.10,1851.45,No,Two year,None,Mailed check
7035,9916-AYHTC,Male,0,No,No,48,Yes,No,3,No internet service,...,No internet service,3,No,4,19.85,916,No,Two year,None,Credit card (automatic)
7038,9950-MTGYX,Male,0,Yes,Yes,28,Yes,No,3,No internet service,...,No internet service,3,Yes,4,20.30,487.95,No,Two year,None,Credit card (automatic)
7039,9953-ZMKSM,Male,0,No,No,63,Yes,Yes,3,No internet service,...,No internet service,3,No,2,25.25,1559.3,No,Two year,None,Mailed check
7042,9975-GPKZU,Male,0,Yes,Yes,46,Yes,No,3,No internet service,...,No internet service,3,No,4,19.75,856.5,No,Two year,None,Credit card (automatic)

In [48]:
telco.gender.value_counts()

Male      3555
Female    3488
Name: gender, dtype: int64

In [49]:
telco[telco.gender.isnull()]

Empty DataFrame
Columns: [customer_id, gender, senior_citizen, partner, dependents, tenure, phone_service, multiple_lines, internet_service_type_id, online_security, online_backup, device_protection, tech_support, streaming_tv, streaming_movies, contract_type_id, paperless_billing, payment_type_id, monthly_charges, total_charges, churn, contract_type, internet_service_type, payment_type]
Index: []

[0 rows x 24 columns]

In [50]:
#from telco.info() can see there are no null values

In [51]:
mask1 = (telco.multiple_lines == 'Yes')
mask2 = (telco.churn == 'Yes')

In [52]:
telco[(telco.multiple_lines == 'Yes') & (telco.churn == 'Yes')]

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
17,0224-HJAPT,Male,0,No,No,5,Yes,Yes,1,No,...,No,1,No,1,47.15,223.15,Yes,Month-to-month,DSL,Electronic check
73,0719-SYFRB,Female,0,No,No,12,Yes,Yes,1,Yes,...,No,1,Yes,2,61.65,713.75,Yes,Month-to-month,DSL,Mailed check
74,0733-VUNUW,Male,0,No,No,24,Yes,Yes,1,Yes,...,No,1,Yes,3,55.65,1400.55,Yes,Month-to-month,DSL,Bank transfer (automatic)
120,1114-CENIM,Male,0,No,Yes,54,Yes,Yes,1,No,...,No,1,Yes,4,55.00,3092.65,Yes,Month-to-month,DSL,Credit card (automatic)
134,1251-KRREG,Male,0,No,No,2,Yes,Yes,1,No,...,No,1,Yes,2,54.40,114.1,Yes,Month-to-month,DSL,Mailed check
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6046,0203-HHYIJ,Male,0,No,No,25,Yes,Yes,3,No internet service,...,No internet service,2,No,3,25.30,676.35,Yes,One year,None,Bank transfer (automatic)
6202,4597-ELFTS,Male,0,No,No,56,Yes,Yes,3,No internet service,...,No internet service,2,No,1,24.90,1334,Yes,One year,None,Electronic check
6465,1043-YCUTE,Male,0,Yes,No,56,Yes,Yes,3,No internet service,...,No internet service,3,Yes,4,25.15,1327.15,Yes,Two year,None,Credit card (automatic)
6910,7951-QKZPL,Female,0,Yes,Yes,33,Yes,Yes,3,No internet service,...,No internet service,3,Yes,2,24.50,740.3,Yes,Two year,None,Mailed check
6951,8515-OCTJS,Female,0,No,No,25,Yes,Yes,3,No internet service,...,No internet service,3,No,4,24.75,692.1,Yes,Two year,None,Credit card (automatic)

In [53]:
telco[mask1 & mask2]

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
17,0224-HJAPT,Male,0,No,No,5,Yes,Yes,1,No,...,No,1,No,1,47.15,223.15,Yes,Month-to-month,DSL,Electronic check
73,0719-SYFRB,Female,0,No,No,12,Yes,Yes,1,Yes,...,No,1,Yes,2,61.65,713.75,Yes,Month-to-month,DSL,Mailed check
74,0733-VUNUW,Male,0,No,No,24,Yes,Yes,1,Yes,...,No,1,Yes,3,55.65,1400.55,Yes,Month-to-month,DSL,Bank transfer (automatic)
120,1114-CENIM,Male,0,No,Yes,54,Yes,Yes,1,No,...,No,1,Yes,4,55.00,3092.65,Yes,Month-to-month,DSL,Credit card (automatic)
134,1251-KRREG,Male,0,No,No,2,Yes,Yes,1,No,...,No,1,Yes,2,54.40,114.1,Yes,Month-to-month,DSL,Mailed check
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6046,0203-HHYIJ,Male,0,No,No,25,Yes,Yes,3,No internet service,...,No internet service,2,No,3,25.30,676.35,Yes,One year,None,Bank transfer (automatic)
6202,4597-ELFTS,Male,0,No,No,56,Yes,Yes,3,No internet service,...,No internet service,2,No,1,24.90,1334,Yes,One year,None,Electronic check
6465,1043-YCUTE,Male,0,Yes,No,56,Yes,Yes,3,No internet service,...,No internet service,3,Yes,4,25.15,1327.15,Yes,Two year,None,Credit card (automatic)
6910,7951-QKZPL,Female,0,Yes,Yes,33,Yes,Yes,3,No internet service,...,No internet service,3,Yes,2,24.50,740.3,Yes,Two year,None,Mailed check
6951,8515-OCTJS,Female,0,No,No,25,Yes,Yes,3,No internet service,...,No internet service,3,No,4,24.75,692.1,Yes,Two year,None,Credit card (automatic)

# Back to working with employee data. Telco df saved for later use.

In [54]:
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])
# df['Start Date'] = pd.to_datetime(df['Start Date'])
# df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

In [55]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-12-27 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-12-27 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-12-27 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-12-27 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-12-27 16:47:00,101004,1.389,True,Client Services

# The .duplicated() Method

In [56]:
df.sort_values("First Name", inplace=True)

In [57]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2020-12-27 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2020-12-27 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2020-12-27 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2020-12-27 19:39:00,63126,18.424,False,Client Services
137,Adam,Male,2011-05-21,2020-12-27 01:45:00,95327,15.120,False,Distribution

In [64]:
#First occurance isn't a duplicate
#Keep parameter is default, can also use last
#Keep false will provide a df with all duplicates
df[df['First Name'].duplicated(keep='first')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
327,Aaron,Male,1994-01-29,2020-12-27 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2020-12-27 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2020-12-27 19:39:00,63126,18.424,False,Client Services
141,Adam,Male,1990-12-24,2020-12-27 20:57:00,110194,14.727,True,Product
302,Adam,Male,2007-07-05,2020-12-27 11:59:00,71276,5.027,True,Human Resources
...,...,...,...,...,...,...,...,...
902,NaN,Male,2001-05-23,2020-12-27 19:52:00,103877,6.322,True,Distribution
925,NaN,Female,2000-08-23,2020-12-27 16:19:00,95866,19.388,True,Sales
946,NaN,Female,1985-09-15,2020-12-27 01:50:00,133472,16.941,True,Distribution
947,NaN,Male,2012-07-30,2020-12-27 15:07:00,107351,5.329,True,Marketing
951,NaN,Female,2010-09-14,2020-12-27 05:19:00,143638,9.662,True,NaN

In [65]:
#Negate it in order to only get all uniques
df[~df['First Name'].duplicated(keep='first')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2020-12-27 10:20:00,61602,11.849,True,Marketing
137,Adam,Male,2011-05-21,2020-12-27 01:45:00,95327,15.120,False,Distribution
300,Alan,Male,1988-06-26,2020-12-27 03:54:00,111786,3.592,True,Engineering
372,Albert,Male,1997-02-01,2020-12-27 16:20:00,67827,19.717,True,Engineering
988,Alice,Female,2004-10-05,2020-12-27 09:34:00,47638,11.209,False,Human Resources
...,...,...,...,...,...,...,...,...
433,Wanda,Female,2008-07-20,2020-12-27 13:44:00,65362,7.132,True,Legal
177,Wayne,Male,2012-04-07,2020-12-27 08:00:00,102652,14.085,True,Distribution
820,William,Male,1993-11-18,2020-12-27 12:27:00,54058,5.182,True,Human Resources
450,Willie,Male,2009-08-22,2020-12-27 13:03:00,55038,19.691,False,Legal
7,NaN,Female,2015-07-20,2020-12-27 10:43:00,45906,11.598,True,Finance

# The .drop_duplicates() Method

In [66]:
len(df)

1000

In [67]:
#Only going to drop a row if all values in a row are identical to another row
len(df.drop_duplicates())

1000

In [70]:
#Keeping first occurance of first name, dropping the others
df.drop_duplicates(subset = ['First Name'], keep='first')

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2020-12-27 10:20:00,61602,11.849,True,Marketing
137,Adam,Male,2011-05-21,2020-12-27 01:45:00,95327,15.120,False,Distribution
300,Alan,Male,1988-06-26,2020-12-27 03:54:00,111786,3.592,True,Engineering
372,Albert,Male,1997-02-01,2020-12-27 16:20:00,67827,19.717,True,Engineering
988,Alice,Female,2004-10-05,2020-12-27 09:34:00,47638,11.209,False,Human Resources
...,...,...,...,...,...,...,...,...
433,Wanda,Female,2008-07-20,2020-12-27 13:44:00,65362,7.132,True,Legal
177,Wayne,Male,2012-04-07,2020-12-27 08:00:00,102652,14.085,True,Distribution
820,William,Male,1993-11-18,2020-12-27 12:27:00,54058,5.182,True,Human Resources
450,Willie,Male,2009-08-22,2020-12-27 13:03:00,55038,19.691,False,Legal
7,NaN,Female,2015-07-20,2020-12-27 10:43:00,45906,11.598,True,Finance